#include <stdio.h>
#include <stdlib.h>
int main()
{
	int a[5][5];
	int(*p)[4];
	p = a;//a[5][5]第一行的地址
	printf("%p %d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);
	//结果为 FF　FF　FF　FC，－４
	//-4在计算机中的补码为11111111 11111111 11111111 11111100，转换为16进制为FF　FF　FF　FC
	//p[4][2]等价于*(*(p+4)+2)
	//p                                       p+4
	//| | | | | |  | | | | | |  | | | | | |  | | | | | |  | | | | | |
	//   a[0]          a[1]        a[2]          a[3]        a[4]
	//p+4跳过4个整形数组,一次跳四个
	system("pause");
	return 0;
}